spacemacs/spacemacs.org
#+TITLE: Spacemacs tangled user configuration
#+STARTUP: headlines
#+STARTUP: nohideblocks
#+STARTUP: noindent
#+OPTIONS: toc:4 h:4
#+PROPERTY: header-args:emacs-lisp :comments link

* Introduction
  This is a tangled user-init and user-config file for spacemacs.

** init.el  
   
** spacemacs.org  
   
To add configuration options before Spacemacs loads, insert the following kind
of src block in your spacemacs.org file

#+BEGIN_SRC emacs-lisp :tangle user-init.el
#+END_SRC

Alternatively, if the block should be loaded after Spacemacs loads, insert the
following test block

#+BEGIN_SRC emacs-lisp :tangle user-config.el
#+END_SRC


* Helper Functions
** Yasnippet creation

To help with creation of your text blocks, there are two snippets defined in the
local snippet directory =~/.spacemacs.d/snippets/org-mode/= folder.

To tangle to the =user-init= file, type =ui=, alternatively =uc= to tangle the =user-config= file.

By default, yasnippet completions are triggered by pressing =M-/= with the point
after one of the supported prefix.

** Find this file
   Create binding to spacemacs.org file

#+BEGIN_SRC emacs-lisp :tangle user-config.el
  (defun spacemacs/find-config-file ()
    (interactive)
    (find-file (concat dotspacemacs-directory "/spacemacs.org")))

  (spacemacs/set-leader-keys "fec" 'spacemacs/find-config-file)

#+END_SRC


* Layers Configuration
** Default settings
   #+BEGIN_SRC emacs-lisp :tangle spacemacs-defaults.el
     (setq-default
      dotspacemacs-distribution 'spacemacs
      dotspacemacs-enable-lazy-installation 'unused
      dotspacemacs-ask-for-lazy-installation t
      dotspacemacs-configuration-layer-path '()
      dotspacemacs-install-packages 'used-only
     )
   #+END_SRC

** Layers to load
   #+BEGIN_SRC emacs-lisp :tangle spacemacs-layers.el
     (setq-default
      dotspacemacs-configuration-layers
      '(
	auto-completion
	better-defaults
	c-c++
	cscope
	emacs-lisp
	emoji
	git
	go
	gtags
	helm
	html
	javascript
	markdown
	(mu4e :variables
	      mu4e-installation-path "/usr/local/share/emacs/site-lisp/mu4e"
	      )
	org
	ranger
	shell
	spell-checking
	syntax-checking
	python
	version-control
	yaml
	)
      )
   #+END_SRC
   
** Initialization
   #+BEGIN_SRC emacs-lisp :tangle spacemacs-init.el
     (setq-default
      dotspacemacs-enable-emacs-pdumper nil
      dotspacemacs-emacs-pdumper-executable-file "emacs-27.0.50"
      dotspacemacs-emacs-dumper-dump-file "spacemacs.pdmp"
      dotspacemacs-elpa-https t
      dotspacemacs-elpa-timeout 5
      dotspacemacs-gc-cons '(100000000 0.1)
      dotspacemacs-use-spacelpa nil
      dotspacemacs-verify-spacelpa-archives nil
      dotspacemacs-check-for-update t
      dotspacemacs-elpa-subdirectory 'emacs-version
      dotspacemacs-editing-style 'vim
      dotspacemacs-verbose-loading nil
      dotspacemacs-startup-banner nil
      dotspacemacs-startup-lists '((recents . 5)
                                   (bookmarks . 5)
                                   (projects . 7))
      dotspacemacs-startup-buffer-responsive t
      dotspacemacs-scratch-mode 'text-mode
      dotspacemacs-initial-scratch-message nil
      dotspacemacs-themes '(spacemacs-dark
                            spacemacs-light)
      dotspacemacs-mode-line-theme '(spacemacs :separator wave :separator-scale 1.5)
      dotspacemacs-colorize-cursor-according-to-state t
      dotspacemacs-default-font '("Ubuntu Mono"
                                  :size 14 :weight normal :width normal)
      dotspacemacs-leader-key "SPC"
      dotspacemacs-emacs-command-key "SPC"
      dotspacemacs-ex-command-key ":"
      dotspacemacs-emacs-leader-key "M-m"
      dotspacemacs-major-mode-leader-key ","
      dotspacemacs-major-mode-emacs-leader-key "C-M-m"
      dotspacemacs-distinguish-gui-tab nil
      dotspacemacs-default-layout-name "Default"
      dotspacemacs-display-default-layout 't
      dotspacemacs-auto-resume-layouts nil
      dotspacemacs-auto-generate-layout-names nil
      dotspacemacs-large-file-size 1
      dotspacemacs-auto-save-file-location 'cache
      dotspacemacs-max-rollback-slots 5
      dotspacemacs-enable-paste-transient-state nil
      dotspacemacs-which-key-delay 0.2
      dotspacemacs-which-key-position 'bottom
      dotspacemacs-switch-to-buffer-prefers-purpose nil
      dotspacemacs-loading-progress-bar nil
      dotspacemacs-fullscreen-at-startup nil
      dotspacemacs-fullscreen-use-non-native nil
      dotspacemacs-maximized-at-startup nil
      dotspacemacs-active-transparency 90
      dotspacemacs-inactive-transparency 90
      dotspacemacs-show-transient-state-title t
      dotspacemacs-show-transient-state-color-guide t
      dotspacemacs-mode-line-unicode-symbols nil
      dotspacemacs-smooth-scrolling t
      dotspacemacs-line-numbers '(:relative t
	   		       :disabled-for-modes dired-mode pdf-view-mode
                                  :size-limit-kb 1000)
      dotspacemacs-folding-method 'evil
      dotspacemacs-smartparens-strict-mode nil
      dotspacemacs-smart-closing-parenthesis nil
      dotspacemacs-highlight-delimiters 'all
      dotspacemacs-enable-server nil
      dotspacemacs-server-socket-dir nil
      dotspacemacs-persistent-server nil
      dotspacemacs-search-tools '("rg" "ag" "pt" "ack" "grep")
      dotspacemacs-frame-title-format "%I@%S"
      dotspacemacs-icon-title-format nil
      dotspacemacs-whitespace-cleanup "trailing"
      dotspacemacs-zone-out-when-idle nil
      dotspacemacs-pretty-docs nil
      )
   #+END_SRC

** Additional custom functions
*** Mu4e Threads Folding
    There is a long standing discussion thread about adding a thread folding
    feature to mu4e:

    https://github.com/djcb/mu/pull/783

    The following code loads a set of mu4e extension functions which are a
    refactoring of the above PR.
    
    
* Initialization
#+BEGIN_SRC emacs-lisp :tangle user-init.el
;; Auto generated user initialization from tangled spacemacs.org

#+END_SRC

** Additional custom functions
*** Mu4e Threads Folding
    There is a long standing discussion thread about adding a thread folding
    feature to mu4e:

    https://github.com/djcb/mu/pull/783

    The following code loads a set of mu4e extension functions which are a
    refactoring of the above PR.
    
    
* Configuration
** General settings
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     ;; Set some sane defaults
     (setq-default
      indent-tabs-mode 't
      tab-width 8
      )

     ;; (defun no-junk-please-were-unixish ()
     ;;   (let ((coding-str (symbol-name buffer-file-coding-system)))
     ;;     (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
     ;;       (set-buffer-file-coding-system 'unix))))
     ;; (add-hook 'find-file-hooks 'no-junk-please-were-unixish)

     ;; Default settings
     (spacemacs/toggle-spelling-checking-off)
     (setq
      powerline-default-separator 'nil
      browse-url-generic-program "chrome-browser"
      ;; http://ergoemacs.org/emacs/emacs_set_default_browser.html
      browse-url-browser-function 'browse-url-chrome
      )
     (defun helm-browse-url (url &rest args)
       (helm-generic-browser url "google-chrome"))
   #+END_SRC

** Autocompletion
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (setq 
      auto-completion-return-key-behavior 'complete
      auto-completion-tab-key-behavior 'cycle
      auto-completion-complete-with-key-sequence nil
      auto-completion-complete-with-key-sequence-delay 0.1
      auto-completion-idle-delay 0.2
      auto-completion-private-snippets-directory nil
      auto-completion-enable-snippets-in-popup t
      auto-completion-enable-help-tooltip t
      auto-completion-enable-sort-by-usage nil
      )
   #+END_SRC

** C-C++
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (setq
      c-default-style '((java-mode . "java")
			(awk-mode . "awk")
			(python-mode . "python")
			(other . "linux")
			)
      )
   #+END_SRC

** CScope
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (define-key evil-normal-state-map (kbd "C-t") 'helm-cscope-pop-mark)
   #+END_SRC

** Evil Mode
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (define-key evil-insert-state-map (kbd "TAB") 'tab-to-tab-stop)
   #+END_SRC

** Magit
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (global-git-commit-mode t)
     (setq
      ;; https://magit.vc/manual/magit/Performance.html
      magit-revision-insert-related-refs nil
      magit-refresh-status-buffer 't
      magit-commit-show-diff nil
      magit-revert-buffers 1
      magit-default-tracking-name-function 'magit-default-tracking-name-branch-only
      magit-log-section-arguments (list "-n50" "--decorate")
      magit-log-cutoff-length 50
      magit-revision-insert-related-refs nil
      magit-repository-directories '(("~/Code/" . 2))
      )
     (setq-default
      git-magit-status-fullscreen 't
      )
     (remove-hook 'magit-refs-sections-hook 'magit-insert-tags)
   #+END_SRC

