spacemacs/user-config.el.bak

;; [[file:~/.spacemacs.d/spacemacs.org::*spacemacs.org][spacemacs\.org:1]]



;; spacemacs\.org:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*Find%20this%20file][Find\ this\ file:1]]

(defun spacemacs/find-config-file ()
  (interactive)
  (find-file (concat dotspacemacs-directory "/spacemacs.org")))

(spacemacs/set-leader-keys "fec" 'spacemacs/find-config-file)

;; Find\ this\ file:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*General%20settings][General\ settings:1]]

;; Set some sane defaults
(setq-default
 indent-tabs-mode 't
 tab-width 8
 )

;; (defun no-junk-please-were-unixish ()
;;   (let ((coding-str (symbol-name buffer-file-coding-system)))
;;     (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
;;       (set-buffer-file-coding-system 'unix))))
;; (add-hook 'find-file-hooks 'no-junk-please-were-unixish)

;; Default settings
(spacemacs/toggle-spelling-checking-off)
(setq
 powerline-default-separator 'nil
 browse-url-generic-program "chrome-browser"
 ;; http://ergoemacs.org/emacs/emacs_set_default_browser.html
 browse-url-browser-function 'browse-url-chrome
 )
(defun helm-browse-url (url &rest args)
  (helm-generic-browser url "google-chrome"))

;; General\ settings:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*Autocompletion][Autocompletion:1]]

(setq 
 auto-completion-return-key-behavior 'complete
 auto-completion-tab-key-behavior 'cycle
 auto-completion-complete-with-key-sequence nil
 auto-completion-complete-with-key-sequence-delay 0.1
 auto-completion-idle-delay 0.2
 auto-completion-private-snippets-directory nil
 auto-completion-enable-snippets-in-popup t
 auto-completion-enable-help-tooltip t
 auto-completion-enable-sort-by-usage nil
 )

;; Autocompletion:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*C-C%2B%2B][C-C++:1]]

(setq
 c-default-style '((java-mode . "java")
                   (awk-mode . "awk")
                   (python-mode . "python")
                   (other . "linux")
                   )
 )

;; C-C++:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*CScope][CScope:1]]

(define-key evil-normal-state-map (kbd "C-t") 'helm-cscope-pop-mark)

;; CScope:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*Evil%20Mode][Evil\ Mode:1]]

(define-key evil-insert-state-map (kbd "TAB") 'tab-to-tab-stop)

;; Evil\ Mode:1 ends here

;; [[file:~/.spacemacs.d/spacemacs.org::*Magit][Magit:1]]

(global-git-commit-mode t)
(setq
 ;; https://magit.vc/manual/magit/Performance.html
 magit-revision-insert-related-refs nil
 magit-refresh-status-buffer 't
 magit-commit-show-diff nil
 magit-revert-buffers 1
 magit-default-tracking-name-function 'magit-default-tracking-name-branch-only
 magit-log-section-arguments (list "-n50" "--decorate")
 magit-log-cutoff-length 50
 magit-revision-insert-related-refs nil
 magit-repository-directories '(("~/Code/" . 2))
 )
(setq-default
 git-magit-status-fullscreen 't
 )
(remove-hook 'magit-refs-sections-hook 'magit-insert-tags)

;; Magit:1 ends here
