spacemacs/spacemacs.org
**** Keybindings
     #+BEGIN_SRC emacs-lisp :tangle user-config.el
       (with-eval-after-load 'mu4e

					       ; Spell checking
	 (add-hook 'mu4e-compose-mode-hook
		   (defun my-do-compose-stuff ()
		     "My settings for message composition."
		     (set-fill-column 72)
		     (flyspell-mode))
		   )
	 )
     #+END_SRC

*** Keybindings
    #+BEGIN_SRC emacs-lisp :tangle user-config.el
      (with-eval-after-load 'mu4e
	(define-key 'mu4e-headers-mode-map (kbd "TAB") 'mu4e-headers-toggle-thread-folding)
	)
    #+END_SRC

** NeoTree
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (setq
      neo-theme 'nerd
      )
   #+END_SRC

** Org Mode
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     ;; To get Org v9 working, these fixes could be required:
     ;;
     ;; - https://emacs.stackexchange.com/questions/32001/org-babel-9-spacemacs-unable-to-evaluate-org-babel-src-blocks
     ;;
     ;; cd .emacs.d/elpa/
     ;; # I suggest to run this without "delete" first.
     ;;   find org* -name "*.elc" -delete
     ;;
     ;; - https://emacs.stackexchange.com/questions/37692/how-to-fix-symbols-function-definition-is-void-org-babel-get-header
     ;;
     ;; replace (sh . t) by (shell . t) in your call of org-babel-do-load-languages

     ; (org-babel-do-load-languages 'org-babel-load-languages
     ; 				  (append org-babel-load-languages
     ; 					  '((shell . t)
     ; 					    (python . t)
     ; 					    (C . t))))

     (setq
      org-enable-sticky-header t
      org-projectile-file "TODOs.org"
      org-want-todo-bindings t
      org-clock-into-drawer "CLOCKING"
      org-default-notes-file (concat org-directory "/Notes.org")
      )

     ;; (setq-default
     ;;  dotspacemacs-configuration-layers '((org :variables org-projectile-file "TODOs.org"))
     ;;  )

     ;; (require 'org-projectile)
     ;; (mapcar '(lambda (file)
     ;; 		(when (file-exists-p file)
     ;; 		  (push file org-agenda-files)))
     ;; 	     (org-projectile-todo-files))
   #+END_SRC

** Shell
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (setq
      shell-default-shell 'ansi-term
      shell-default-term-shell "/bin/zsh"
      shell-default-height 30
      shell-default-position 'bottom
      )
   #+END_SRC

** Spell checking
   #+BEGIN_SRC emacs-lisp :tangle user-config.el
     (setq
      spell-checking-enable-by-default nil
      enable-flyspell-auto-completion t
      )
   #+END_SRC

   
   
